from s38_2 import get_details, install_chrome_driver

def result():
    data = {'company_info': 
    {
    '종목명': '노브랜드', '진행상황': '공모주', '시장구분': '코스닥', '종목코드': '145170', '업종': '의복,의복액세서리 및 모피제품 제조업', '대표자': '이상규', '본점소재지': '서울특별시 송파구 오금로46길 49 (가락동) 노브랜드', '홈페이지': '', '최대주주': '김기홍 42%', 
    '매출액': '552,897 (백만원)', '법인세비용차감전계속사업이익': '41,909 (백만원)', '순이익': '29,346 (백만원)', '자본금': '3,478 (백만원)'}, 'offering_info': {'총공모주식수': '1,200,000 주', '액면가': '500 원', '상장공모': '신주모집 : 1,200,000 주 (100%)', 
    '희망공모가액': '8,700 ~ 11,000원', '확정공모가': '14,000원', '공모금액': '16,800 (백만원)', '주간사': '삼성증권'}, 'schedule_info': {'공모청약일': '2024.05.13 ~  2024.05.14', '납입일': '2024.05.17', '환불일': '2024.05.17', '상장일': '2024.05.23', 'IR일자': '2024.05.03', '기관경쟁률': '1075.61:1', 
    '의무보유확약': '4.51%', '신규상장일': '2024.05.23', '현재가': '- 원 (%)'}, 'expected_participation': {'참여건수': '2,044', '신청주식수': '968,048,822', '단순경쟁': '1075.61:1'}, 'nav_per_share': {'자본총계': '97,851,708,226', '무형자산 등 차감': '4,019,545,154', '이연자산 연부채': '', 
    '순자산 총계': '93,832,163,072', '기말 발행주식수': '4,956,128', '자산가치': '18,933원'}, 'earnings_value_per_share': {'순이익': {'2023년': '751,396,154', '2022년': '2,505,238,244', '2021년': '5,401,461,811'}, '발행주식수': {'2023년': '4,956,128', '2022년': '5,408,680', '2021년': '5,408,680'}, '주당 이익(EPS)': {'2023년': '152', '2022년': '463', '2021년': '999'}, '가중평균 EPS': '397', '자본환원율(%)': '10%', '수익가치 (평가법 1)': '3,970원'}, 'intrinsic_value_per_share': {'1주당 금액': {'자산가치': '18,933', '수익가치(평가1)': '3,970'}, '본질가치 (평가법 1)': '9,955원'}, 'financial_ratio': {'안정성': {'부채비율': {'2021.12.31': '167.84 %', '2020.12.31': '268.28 %'}, '90.14 %': {'2021.12.31': '123.40 %', '2020.12.31': '116.61 %'}}, '수익성': {'자기자본수익률': {'2021.12.31': '30.44 %', '2020.12.31': '17.83 %'}, '6.01 %': {'2021.12.31': '4.78 %', '2020.12.31': '-1.96 %'}}, '성장성': {'매출액증가율': {'2021.12.31': '18.71 %', '2020.12.31': '18.31 %'}, '49.02 %': {'2021.12.31': '-382.69 %', '2020.12.31': '-194.31 %'}}}, 'stock_price_indicators': {'EPS(주당순이익)': {'2022.12.31': '4,219', '2021.12.31': '1,771', '2020.12.31': '-2,526'}, 'PER(주가수익비율)공모가 대비': {'2022.12.31': '2.61', '2021.12.31': '6.21', '2020.12.31': '-4.35'}, 'BPS(주당순자산가치)': {'2022.12.31': '13,858', '2021.12.31': '9,933', '2020.12.31': '7,578'}, 'PBR(주가순자산비율)': {'2022.12.31': '0.79', '2021.12.31': '1.11', '2020.12.31': '1.45'}, 
    'SPS(주당매출액)': {'2022.12.31': '79,920', '2021.12.31': '67,325', '2020.12.31': '56,907'}, 'PSR(주가매출액비율)': {'2022.12.31': '0.14', '2021.12.31': '0.16', '2020.12.31': '0.19'}}
    }
    return data

# https://www.38.co.kr/html/fund/?o=v&no=2044&l=&page=1 현대마린
# https://www.38.co.kr/html/fund/?o=v&no=2045&l=&page=1 KB스펙28호

def test_get_details():
    ''' 노브랜드 '''
    driver = install_chrome_driver()
    data = result()
    detail = get_details('https://www.38.co.kr/html/fund/?o=v&no=2036&l=&page=1')
    print(detail)
    assert detail['company_info'] == data['company_info']
    assert detail['offering_info'] == data['offering_info']
    assert detail['schedule_info'] == data['schedule_info']
    assert detail['expected_participation'] == data['expected_participation']
    assert detail['nav_per_share'] == data['nav_per_share']
    assert detail['earnings_value_per_share'] == data['earnings_value_per_share']
    assert detail['intrinsic_value_per_share'] == data['intrinsic_value_per_share']
    assert detail['financial_ratio'] == data['financial_ratio']
    assert detail['stock_price_indicators'] == data['stock_price_indicators']
    driver.quit()

