from  simple_calc import calc


expr = "(1.58128767e-03 * 매출액) + (4.23712397e-03 * 기관경쟁률) - (2.43198524e-01 * 의무보유확약) + 2.055371789303263"

variables = {
    "매출액" : 5528.97,
    "기관경쟁률" : 1075.61,
    "의무보유확약" : 4.51
}
result = calc(expr, variables)
print (result)
매출액 = 5528.97
기관경쟁률 = 1075.61
의무보유확약 = 4.51

매출액 = 11.53
기관경쟁률 = 1084.39
의무보유확약 = 2.06

매출액 = 20.55
기관경쟁률 = 1115.44
의무보유확약 = 9.93

매출액 = 1321.42
기관경쟁률 = 124.5
의무보유확약 = 0.95


#result = (1.58128767e-03 * 5528.97) + (4.23712397e-03 * 1075.61) - (2.43198524e-01 * 4.51) + 2.055371789303263
result = (0.00013197 * 매출액) + (0.00167363 * 기관경쟁률) - (0.07575512 * 의무보유확약) + 2.65881963178594
result2 =round( result * 17000 / 500) * 500
print(result2)